Revit 2024 API
FilterElement Class
 The base class for filter elements in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class FilterElement : Element
Visual Basic
Public Class FilterElement _
	Inherits Element
Visual C++
public ref class FilterElement : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.FilterElement
 Autodesk.Revit.DB.ParameterFilterElement
 Autodesk.Revit.DB.SelectionFilterElement
See Also
FilterElement Members
Autodesk.Revit.DB Namespace